Revit 2026 API

# RebarConstraintTargetIsBarBend Method

---

Returns true if the RebarTargetConstraintType of the RebarConstraint is 'BarBend'.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool TargetIsBarBend()
```
```vb
Public Function TargetIsBarBend As Boolean
```
```cpp
public:
bool TargetIsBarBend()
```
```fsharp
member TargetIsBarBend : unit -> bool
```

#### Return Value

Boolean

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace